export default {
  // 点击登陆后 获取用户的莹石识别 时出错的相关信息
  loginErrorInfo: {
    '1001': {
      msg: '用户名或密码错误'
    },
    '1002': {
      msg: '用户名或密码错误'
    },
    '1004': {
      msg: '您的账户已冻结'
    },
    '1006': {
      msg: '硬件特征码sign值错误'
    },
    '1007': {
      msg: '参数不完整'
    },
    '1008': {
      msg: '账户无权限登录'
    },
    '1025': {
      msg: '登录账号和开发者账号不符或无操作权限,请通过官方邮件申请权限'
    }
  },

  // 获取token与accessToken时出错的信息
  getTokenErrorInfo:{
    '50008':{
      msg:'请到web页面补充企业信息'
    },
    '50014':{
      msg:'授权码不正确'
    },
    '50017':{
      msg:'授权码过期'
    }
  }
};
